app/controllers/pledges_controller.rb

  def index
    @pledges = Pledge.all
---
SELECT "pledges".* FROM "pledges"

  def create
    project = Project.find(params[:project_id])
    @pledge = @cart.add_project(project.id)
    @pledge.amount += params[:amount].to_f
    @pledge.user_id = current_user.id
    #@pledge = @cart.pledges.build(project: project)
    #@pledge = Pledge.new(pledge_params)

    respond_to do |format|
      if @pledge.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-09-21 07:32:03.663660"], ["updated_at", "2016-09-21 07:32:03.663660"]]