app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    #@projects = Project.all.sort_by{|likes| likes.thumbs_up_total}
     @projects = Project.paginate(page: params[:page], per_page: 2)